{
    "hadiths": [
        {
            "id": 1,
            "title": "إنما الأعمال بالنيات",
            "narrator": "أمير المؤمنين أبي حفص عمر بن الخطاب رضي الله عنه",
            "hadith": "سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ: ( إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ، وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى دُنْيَا يُصِيبُهَا، أَوْ إِلَى امْرَأَةٍ يَنْكِحُهَا، فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ ).",
            "explanation": "هذا الحديث أصل عظيم في الدين، ومعناه أن صحة وقبول الأعمال تعتمد على نية فاعلها. فإذا كانت النية صالحة لله تعالى، قُبل العمل، وإن كانت لغيره، لم يُقبل. ويضرب الحديث مثلاً بالهجرة، فمن هاجر طلبًا لرضا الله ورسوله فهجرته مقبولة، ومن هاجر لغرض دنيوي كالتجارة أو الزواج، فليس له من أجر الهجرة شيء."
        },
        {
            "id": 2,
            "title": "مراتب الدين",
            "narrator": "عمر بن الخطاب رضي الله عنه أيضاً",
            "hadith": "بَيْنَمَا نَحْنُ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم ذَاتَ يَوْمٍ، إِذْ طَلَعَ عَلَيْنَا رَجُلٌ شَدِيدُ بَيَاضِ الثِّيَابِ، شَدِيدُ سَوَادِ الشَّعَرِ، لا يُرَى عَلَيْهِ أَثَرُ السَّفَرِ، وَلا يَعْرِفُهُ مِنَّا أَحَدٌ، حَتَّى جَلَسَ إِلَى النَّبِيِّ صلى الله عليه وسلم... فسأله عن الإسلام والإيمان والإحسان والساعة وأماراتها.",
            "explanation": "يُعرف هذا بحديث جبريل، وفيه يبين النبي صلى الله عليه وسلم أصول الدين الثلاثة: الإسلام وهو الأعمال الظاهرة كالصلاة والصيام، والإيمان وهو المعتقدات الباطنة كالإيمان بالله وملائكته، والإحسان وهو أعلى المراتب ويعني عبادة الله كأنك تراه. كما يتضمن الحديث ذكر بعض علامات يوم القيامة."
        },
        {
            "id": 3,
            "title": "أركان الإسلام",
            "narrator": "أبي عبد الرحمن عبد الله بن عمر بن الخطاب رضي الله عنهما",
            "hadith": "سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ: ( بُنِيَ الإِسْلامُ عَلَى خَمْسٍ: شَهَادَةِ أَنْ لا إِلَهَ إِلا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَإِقَامِ الصَّلاةِ، وَإِيتَاءِ الزَّكَاةِ، وَحَجِّ الْبَيْتِ، وَصَوْمِ رَمَضَانَ ).",
            "explanation": "يحدد هذا الحديث الأعمدة الخمسة التي يقوم عليها دين الإسلام، وهي الشهادتان، وإقامة الصلاة في أوقاتها بشروطها، وإعطاء الزكاة للمستحقين، وحج بيت الله الحرام لمن استطاع إليه سبيلاً، وصيام شهر رمضان."
        },
        {
            "id": 4,
            "title": "مراحل خلق الإنسان",
            "narrator": "أبي عبد الرحمن عبد الله بن مسعود رضي الله عنه",
            "hadith": "حَدَّثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَهُوَ الصَّادِقُ الْمَصْدُوقُ: ( إِنَّ أَحَدَكُمْ يُجْمَعُ خَلْقُهُ فِي بَطْنِ أُمِّهِ أَرْبَعِينَ يَوْمًا، ثُمَّ يَكُونُ فِي ذَلِكَ عَلَقَةً مِثْلَ ذَلِكَ، ثُمَّ يَكُونُ فِي ذَلِكَ مُضْغَةً مِثْلَ ذَلِكَ، ثُمَّ يُرْسَلُ الْمَلَكُ فَيَنْفُخُ فِيهِ الرُّوحَ، وَيُؤْمَرُ بِأَرْبَعِ كَلِمَاتٍ: بِكَتْبِ رِزْقِهِ، وَأَجَلِهِ، وَعَمَلِهِ، وَشَقِيٌّ أَوْ سَعِيدٌ ).",
            "explanation": "يصف الحديث مراحل تطور الجنين في بطن أمه، ويبين أن الله سبحانه وتعالى قدّر للإنسان رزقه وعمره وعمله ومصيره في الآخرة وهو لا يزال في رحم أمه. وهذا يؤكد على الإيمان بالقدر خيره وشره."
        },
        {
            "id": 5,
            "title": "النهي عن الابتداع في الدين",
            "narrator": "أم المؤمنين أم عبد الله عائشة رضي الله عنها",
            "hadith": "قَالَتْ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: ( مَنْ أَحْدَثَ فِي أَمْرِنَا هَذَا مَا لَيْسَ فِيهِ، فَهُوَ رَدٌّ ).",
            "explanation": "هذا الحديث قاعدة عظيمة في أن كل عبادة أو عمل يُتقرب به إلى الله يجب أن يكون موافقًا لما جاء به النبي صلى الله عليه وسلم. وأي عمل يُخترع في الدين ليس له أصل في الكتاب أو السنة فهو مردود على صاحبه وغير مقبول."
        },
        {
            "id": 6,
            "title": "البعد عن الشبهات",
            "narrator": "أبي عبد الله النعمان بن بشير رضي الله عنهما",
            "hadith": "سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ: ( إِنَّ الْحَلالَ بَيِّنٌ، وَإِنَّ الْحَرَامَ بَيِّنٌ، وَبَيْنَهُمَا مُشْتَبِهَاتٌ لا يَعْلَمُهُنَّ كَثِيرٌ مِنْ النَّاسِ، فَمَنْ اتَّقَى الشُّبُهَاتِ اسْتَبْرَأَ لِدِينِهِ وَعِرْضِهِ، وَمَنْ وَقَعَ فِي الشُّبُهَاتِ وَقَعَ فِي الْحَرَامِ... أَلا وَإِنَّ فِي الْجَسَدِ مُضْغَةً إِذَا صَلَحَتْ صَلَحَ الْجَسَدُ كُلُّهُ، وَإِذَا فَسَدَتْ فَسَدَ الْجَسَدُ كُلُّهُ، أَلا وَهِيَ الْقَلْبُ ).",
            "explanation": "يرشدنا الحديث إلى أن الأمور في الدين ثلاثة أقسام: حلال واضح، وحرام واضح، وأمور مشتبهة غير واضحة الحكم. والورع يقتضي ترك هذه الشبهات حفاظًا على الدين والعرض. ثم يبين الحديث أن صلاح الجسد كله بصلاح القلب، وفساده بفساد القلب."
        }
    ]
}
